socialies/app/controllers/friendships_controller.rb

  def show
    @my_requests = Friendship.where(:user_id=>params[:id])
    # @my_requests = Friendship.find_by_user_id(params[:id])
    @request_mes = Friendship.where(:friend_user_id=>params[:id])
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."friend_user_id" = $1 LIMIT $2  [["friend_user_id", 1], ["LIMIT", 1]]

  def create
    @friendship = Friendship.new(friendship_params)

    if @friendship.save
---
INSERT INTO "friendships" ("user_id", "friend_user_id", "room_id") VALUES ($1, $2, $3)  [["user_id", 4], ["friend_user_id", 3], ["room_id", 888]]

  def destroy
    @friendship = Friendship.find_by_room_id(params[:id])
    @user1 = User.find(@friendship.user_id)
    @user2 = User.find(@friendship.friend_user_id)
    @user1.friendships.delete(@user2)
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."room_id" = $1 LIMIT $2  [["room_id", 1234], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_user_id" = $1  [["friend_user_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_user_id" = $2  [["user_id", 4], ["friend_user_id", 1]]