app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "picture_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "description" = $3, "gender" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "Mad"], ["last_name", "Lang"], ["description", "hi"], ["gender", "Male"], ["updated_at", "2019-05-10 14:00:59.521902"], ["id", 11]]
---
  def update
    if @user.update(user_params)